Autodesk.Revit.UI.Selection.Selection.GetElementIds
The ids of the elements that are currently selected.
Remarks: Refers to the same set of elements as the Selection.Elements property. The collection returned by this method allows these elements to be processed
with the same filtering logic and FilteredElementCollector constructor as regular iterations.
Returns: A collection containing the ids of the selected elements.

Autodesk.Revit.UI.Selection.Selection.Elements
The elements that are shown as selected in the Revit user-interface.
The selected elements.
Remarks: PickOne and WindowSelect add to this set because they modify the set of elements selected in the user-interface
after the External Command is complete. Selections made with PickObject, PickObjects, and PickElementsByRectangle do not
persist after the External Command is complete, and therefore they do not affect this property.

Autodesk.Revit.UI.Selection.Selection
Contains the current user selection of elements within the project.
Remarks: The Selection object is used to retrieve the current user selected elements when an
external API command is executed.